Revit 2027 API
ParameterTypeId.ThermalMaterialParamLiquidViscosity Property
 "Liquid Viscosity"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ThermalMaterialParamLiquidViscosity { get; }
Public Shared ReadOnly Property ThermalMaterialParamLiquidViscosity As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ThermalMaterialParamLiquidViscosity {
	ForgeTypeId^ get ();
}
static member ThermalMaterialParamLiquidViscosity : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace